tap "steipete/tap"
brew "node"
brew "aws-cdk"
brew "python@3.13"
brew "awscli"
brew "chezmoi"
brew "cmake"
brew "dockutil"
brew "docutils"
brew "duti"
brew "gcalcli"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "git-flow-avh"
brew "go"
brew "himalaya"
brew "imagemagick"
brew "jq"
brew "jupyterlab"
brew "libpq"
brew "llm"
brew "mas"
brew "mono"
brew "ntfy"
brew "nvm"
brew "openjdk@11"
brew "pipx"
brew "postgresql@14"
brew "python@3.12"
brew "rbenv"
brew "terminal-notifier"
brew "uv"
brew "vim"
brew "wget"
brew "yarn"
cask "1password"
cask "1password-cli"
cask "acorn"
cask "aws-vpn-client"
cask "balsamiq-wireframes"
cask "claude"
cask "claude-code"
cask "steipete/tap/codexbar"
cask "cursor"
cask "docker-desktop"
cask "firefox"
cask "font-digital-numbers"
cask "gcloud-cli"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "jetbrains-toolbox"
cask "lm-studio"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "nordvpn"
cask "notion"
cask "onedrive"
cask "pages-data-merge"
cask "panda"
cask "postman"
cask "powershell"
cask "proxyman"
cask "raycast"
cask "rectangle-pro"
cask "shottr"
cask "slack"
cask "spacewalker"
cask "spotify"
cask "stats"
cask "swiftbar"
cask "termius"
cask "todoist-app"
cask "visual-studio-code"
cask "whatsapp"
mas "Paint S", id: 736473980
vscode "1password.op-vscode"
vscode "42crunch.vscode-openapi"
vscode "aleksandardev.vscode-sequence-diagrams"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amrrkf.aws-cdk-construct-snippet"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "joshuapoehls.json-escaper"
vscode "m4ns0ur.base64"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "unclebeast.har-viewer"
